''' Программа вычисляет кол-во набранных баллов за угаданное слово'''
ball = {'A':1, 'E':1, 'I':1, 'L':1, 'N':1, 'O':1, 'R':1, 'S':1, 'T':1, 'U':1, 'D':2, 'G':2, 'B':3, 'C':3, 'M':3, 'P':3,
'F':4, 'H':4, 'V':4, 'W':4, 'Y':4, 'K':5, 'J':8, 'X':8, 'Q':10, 'Z':10}
res=0
word_1 = list(input('Угаданное слово > ').upper())
for i in range(len(word_1)):
    if word_1[i] in ball.keys():
        res += ball[word_1[i]]
print(f'Получено {res} баллов')


#Угаданное слово > RghI Gls,D R
#Получено 15 баллов


        
  
